experiments/hipstershop_singlenode/expected_results/qps2000/wrk.log
Running 2m test @ http://ip-172-31-10-123.us-east-2.compute.internal:8080
  4 threads and 64 connections
  Thread calibration: mean lat.: 4.010ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.021ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.997ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.022ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.01ms    1.64ms  27.07ms   75.53%
    Req/Sec   522.43    104.27     1.08k    61.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.74ms
 75.000%    4.72ms
 90.000%    6.05ms
 99.000%    9.38ms
 99.900%   13.89ms
 99.990%   19.89ms
 99.999%   25.14ms
100.000%   27.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.750     0.000000            2         1.00
       2.267     0.100000        27997         1.11
       2.827     0.200000        56074         1.25
       3.167     0.300000        84095         1.43
       3.453     0.400000       112070         1.67
       3.737     0.500000       140065         2.00
       3.887     0.550000       154058         2.22
       4.051     0.600000       167926         2.50
       4.243     0.650000       182158         2.86
       4.459     0.700000       196087         3.33
       4.719     0.750000       209902         4.00
       4.879     0.775000       216951         4.44
       5.055     0.800000       223921         5.00
       5.251     0.825000       230912         5.71
       5.475     0.850000       237892         6.67
       5.739     0.875000       244956         8.00
       5.883     0.887500       248378         8.89
       6.051     0.900000       251930        10.00
       6.231     0.912500       255360        11.43
       6.447     0.925000       258901        13.33
       6.695     0.937500       262393        16.00
       6.831     0.943750       264132        17.78
       6.987     0.950000       265892        20.00
       7.171     0.956250       267606        22.86
       7.399     0.962500       269361        26.67
       7.651     0.968750       271108        32.00
       7.799     0.971875       271977        35.56
       7.971     0.975000       272859        40.00
       8.167     0.978125       273722        45.71
       8.399     0.981250       274622        53.33
       8.671     0.984375       275480        64.00
       8.831     0.985938       275925        71.11
       9.015     0.987500       276352        80.00
       9.239     0.989062       276797        91.43
       9.479     0.990625       277227       106.67
       9.791     0.992188       277660       128.00
       9.959     0.992969       277877       142.22
      10.175     0.993750       278096       160.00
      10.415     0.994531       278318       182.86
      10.711     0.995313       278537       213.33
      11.071     0.996094       278750       256.00
      11.287     0.996484       278863       284.44
      11.495     0.996875       278973       320.00
      11.735     0.997266       279079       365.71
      12.015     0.997656       279191       426.67
      12.391     0.998047       279297       512.00
      12.599     0.998242       279353       568.89
      12.839     0.998437       279406       640.00
      13.183     0.998633       279462       731.43
      13.455     0.998828       279519       853.33
      13.975     0.999023       279573      1024.00
      14.191     0.999121       279598      1137.78
      14.463     0.999219       279626      1280.00
      14.863     0.999316       279652      1462.86
      15.303     0.999414       279681      1706.67
      15.679     0.999512       279707      2048.00
      15.943     0.999561       279721      2275.56
      16.207     0.999609       279734      2560.00
      16.639     0.999658       279748      2925.71
      16.991     0.999707       279762      3413.33
      17.391     0.999756       279775      4096.00
      17.679     0.999780       279784      4551.11
      17.903     0.999805       279789      5120.00
      18.415     0.999829       279796      5851.43
      18.975     0.999854       279803      6826.67
      19.343     0.999878       279809      8192.00
      19.711     0.999890       279813      9102.22
      19.919     0.999902       279817     10240.00
      20.063     0.999915       279820     11702.86
      20.847     0.999927       279823     13653.33
      21.375     0.999939       279826     16384.00
      21.503     0.999945       279828     18204.44
      22.335     0.999951       279830     20480.00
      22.367     0.999957       279832     23405.71
      22.863     0.999963       279833     27306.67
      23.391     0.999969       279835     32768.00
      23.567     0.999973       279836     36408.89
      23.631     0.999976       279837     40960.00
      24.047     0.999979       279838     46811.43
      24.047     0.999982       279838     54613.33
      24.175     0.999985       279839     65536.00
      25.135     0.999986       279840     72817.78
      25.135     0.999988       279840     81920.00
      25.743     0.999989       279841     93622.86
      25.743     0.999991       279841    109226.67
      25.743     0.999992       279841    131072.00
      26.687     0.999993       279842    145635.56
      26.687     0.999994       279842    163840.00
      26.687     0.999995       279842    187245.71
      26.687     0.999995       279842    218453.33
      26.687     0.999996       279842    262144.00
      27.087     0.999997       279843    291271.11
      27.087     1.000000       279843          inf
#[Mean    =        4.007, StdDeviation   =        1.643]
#[Max     =       27.072, Total count    =       279843]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.99ms
 75.000%    3.95ms
 90.000%    5.29ms
 99.000%    8.61ms
 99.900%   13.17ms
 99.990%   19.15ms
 99.999%   23.95ms
100.000%   26.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.664     0.000000            1         1.00
       1.665     0.100000        27989         1.11
       2.237     0.200000        56133         1.25
       2.525     0.300000        84148         1.43
       2.759     0.400000       112174         1.67
       2.995     0.500000       139924         2.00
       3.127     0.550000       154057         2.22
       3.277     0.600000       167963         2.50
       3.457     0.650000       182017         2.86
       3.675     0.700000       195900         3.33
       3.955     0.750000       209898         4.00
       4.119     0.775000       216962         4.44
       4.299     0.800000       223912         5.00
       4.503     0.825000       230918         5.71
       4.731     0.850000       237961         6.67
       4.991     0.875000       244929         8.00
       5.135     0.887500       248416         8.89
       5.291     0.900000       251865        10.00
       5.475     0.912500       255415        11.43
       5.683     0.925000       258923        13.33
       5.919     0.937500       262372        16.00
       6.059     0.943750       264136        17.78
       6.215     0.950000       265872        20.00
       6.395     0.956250       267607        22.86
       6.615     0.962500       269355        26.67
       6.879     0.968750       271132        32.00
       7.023     0.971875       271991        35.56
       7.195     0.975000       272857        40.00
       7.387     0.978125       273736        45.71
       7.615     0.981250       274606        53.33
       7.903     0.984375       275471        64.00
       8.055     0.985938       275911        71.11
       8.255     0.987500       276365        80.00
       8.463     0.989062       276795        91.43
       8.719     0.990625       277225       106.67
       9.023     0.992188       277660       128.00
       9.183     0.992969       277887       142.22
       9.391     0.993750       278099       160.00
       9.639     0.994531       278318       182.86
       9.951     0.995313       278533       213.33
      10.271     0.996094       278753       256.00
      10.455     0.996484       278862       284.44
      10.735     0.996875       278971       320.00
      11.023     0.997266       279078       365.71
      11.287     0.997656       279188       426.67
      11.631     0.998047       279297       512.00
      11.823     0.998242       279353       568.89
      12.119     0.998437       279407       640.00
      12.431     0.998633       279462       731.43
      12.815     0.998828       279517       853.33
      13.239     0.999023       279570      1024.00
      13.519     0.999121       279598      1137.78
      13.815     0.999219       279626      1280.00
      14.087     0.999316       279652      1462.86
      14.535     0.999414       279680      1706.67
      15.087     0.999512       279709      2048.00
      15.287     0.999561       279721      2275.56
      15.567     0.999609       279734      2560.00
      15.911     0.999658       279748      2925.71
      16.271     0.999707       279762      3413.33
      16.527     0.999756       279775      4096.00
      16.799     0.999780       279782      4551.11
      17.215     0.999805       279789      5120.00
      17.599     0.999829       279796      5851.43
      18.303     0.999854       279803      6826.67
      18.607     0.999878       279809      8192.00
      18.831     0.999890       279813      9102.22
      19.167     0.999902       279816     10240.00
      19.567     0.999915       279821     11702.86
      20.447     0.999927       279823     13653.33
      20.767     0.999939       279826     16384.00
      21.103     0.999945       279828     18204.44
      21.823     0.999951       279830     20480.00
      21.919     0.999957       279832     23405.71
      21.951     0.999963       279833     27306.67
      22.671     0.999969       279835     32768.00
      22.799     0.999973       279836     36408.89
      23.087     0.999976       279837     40960.00
      23.327     0.999979       279838     46811.43
      23.327     0.999982       279838     54613.33
      23.679     0.999985       279839     65536.00
      23.951     0.999986       279840     72817.78
      23.951     0.999988       279840     81920.00
      24.655     0.999989       279841     93622.86
      24.655     0.999991       279841    109226.67
      24.655     0.999992       279841    131072.00
      26.479     0.999993       279842    145635.56
      26.479     0.999994       279842    163840.00
      26.479     0.999995       279842    187245.71
      26.479     0.999995       279842    218453.33
      26.479     0.999996       279842    262144.00
      26.815     0.999997       279843    291271.11
      26.815     1.000000       279843          inf
#[Mean    =        3.303, StdDeviation   =        1.593]
#[Max     =       26.800, Total count    =       279843]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299954 requests in 2.50m, 571.67MB read
Requests/sec:   1999.66
Transfer/sec:      3.81MB